#include "global.h"

struct UnkStruct_021974e8_00
{
    void * unk_00;
    u8 unk_04;
    u8 unk_05;
    u8 unk_06;
    u8 unk_07;
    s16 unk_08;
    s16 unk_0a;
};

struct UnkStruct_021974e8_04_00
{
    void * unk_00;
    void * unk_04;
    void * unk_08;
    s32 unk_0c;
};

struct UnkStruct_021974e8_04
{
    struct UnkStruct_021974e8_04_00 * unk_00;
    s32 unk_04;
};

struct UnkStruct_021974e8
{
    struct UnkStruct_021974e8_00 * unk_00;
    struct UnkStruct_021974e8_04 * unk_04;
};

extern struct UnkStruct_021974e8 data_021974e8;

struct EventProc_unk_38
{
    /* 00 */ char unk_00[0xc]; // Length unknown?
    /* 0C */ s8 type;
    /* 0D */ STRUCT_PAD(0x0D, 0x14);
    /* 14 */ s16 args[6];
};

struct EventFuncInput
{
    u32 unk_00;
    u32 unk_04;
    u32 unk_08;
    STRUCT_PAD(0x0C, 0x20);
};

typedef BOOL (*EventFunc)(struct EventProc_unk_38 *, struct EventFuncInput *);

struct EventProc
{
    /* 00 */ PROC_HEADER
    /* 38 */ struct EventProc_unk_38 * unk_38;
    /* 3C */ int unk_3c;
    /* 40 */ EventFunc unk_40;
    /* 44 */ int unk_44;
    /* 48 */ int unk_48;
    /* 4C */ STRUCT_PAD(0x4C, 0x64);
    /* 64 */ u32 unk_64;
    /* 68 */ u8 unk_68;
};

extern u32 data_021974f0;

extern void * data_020d5e18[]; // func table?
extern void * data_020d5e2c[]; // func table?

extern struct ProcFuncTable ProcFuncTable_EventCaller;
extern struct ProcFuncTable ProcFuncTable_020d5e58;
extern struct ProcCmd ProcScr_EventCaller[];
extern struct ProcCmd ProcScr_020d5e88[];

extern struct UnkStruct_02196f0c * data_02196f0c;

void func_02047450(void)
{
    RegisterEventFunctions();
    return;
}

void func_0204745c(void)
{
    Proc_EndEachMarked(PROC_MARK_A);

    if (data_ov000_021e3328 != NULL)
    {
        func_ov000_021a516c(data_ov000_021e3328->unk_00);
    }

    func_ov000_021db624();

    if (data_ov000_021e3328 != NULL)
    {
        func_ov000_021bb318(data_ov000_021e3328->unk_14->unk_00);
    }

    return;
}

static inline BOOL TRICERATOPS(s32 a)
{
    if (a == 4)
    {
        return TRUE;
    }

    return FALSE;
}

void func_020474a8(struct EventProc * proc)
{
    BOOL flag;

